apache/nuttx/arch/arm/src/common/stm32/stm32_otghshost_m3m4_v1.c
      /* Clear the pending the CHannel Halted (CHH) interrupt */

      stm32_putreg(STM32_OTGHS_HCINT(chidx), OTGHS_HCINT_CHH);
    }

  /* Check for a transfer complete event */

  stm32_chan_wakeup(priv, chan);
}

/****************************************************************************
 * Name: stm32_gint_connected
 *
 * Description:
 *   Handle a connection event.
 *
 ****************************************************************************/

static void stm32_gint_connected(struct stm32_usbhost_s *priv)
{
  /* We we previously disconnected? */

  if (!priv->connected)
    {
      /* Yes.. then now we are connected */

      usbhost_vtrace1(OTGHS_VTRACE1_CONNECTED, 0);
      priv->connected = true;
      priv->change    = true;
      DEBUGASSERT(priv->smstate == SMSTATE_DETACHED);

      /* Notify any waiters */

      priv->smstate = SMSTATE_ATTACHED;
      if (priv->pscwait)
        {
          nxsem_post(&priv->pscsem);
          priv->pscwait = false;
        }
    }
}

/****************************************************************************
 * Name: stm32_gint_disconnected
 *
 * Description:
 *   Handle a disconnection event.
 *
 ****************************************************************************/

static void stm32_gint_disconnected(struct stm32_usbhost_s *priv)
{
  /* Were we previously connected? */

  if (priv->connected)
    {
      /* Yes.. then we no longer connected */

      usbhost_vtrace1(OTGHS_VTRACE1_DISCONNECTED, 0);

      /* Are we bound to a class driver? */

      if (priv->rhport.hport.devclass)
        {
          /* Yes.. Disconnect the class driver */

          CLASS_DISCONNECTED(priv->rhport.hport.devclass);
           priv->rhport.hport.devclass = NULL;
        }

      /* Re-Initialize Host for new Enumeration */

      priv->smstate   = SMSTATE_DETACHED;
      priv->connected = false;
      priv->change    = true;
      stm32_chan_freeall(priv);

      priv->rhport.hport.speed = USB_SPEED_FULL;
      priv->rhport.hport.funcaddr = 0;

      /* Notify any waiters that there is a change in the connection state */

      if (priv->pscwait)
        {
          nxsem_post(&priv->pscsem);
          priv->pscwait = false;
        }
    }
}

/****************************************************************************
 * Name: stm32_gint_sofisr
 *
 * Description:
 *   USB OTG HS start-of-frame interrupt handler
 *
 ****************************************************************************/

#ifdef CONFIG_STM32_OTGHS_SOFINTR
static inline void stm32_gint_sofisr(struct stm32_usbhost_s *priv)
{
  /* Handle SOF interrupt */

#warning "Do what?"

  /* Clear pending SOF interrupt */

  stm32_putreg(STM32_OTGHS_GINTSTS, OTGHS_GINT_SOF);
}
#endif

/****************************************************************************
 * Name: stm32_gint_rxflvlisr
 *
 * Description:
 *   USB OTG HS RxFIFO non-empty interrupt handler
 *
 ****************************************************************************/

static inline void stm32_gint_rxflvlisr(struct stm32_usbhost_s *priv)
{
  uint32_t *dest;
  uint32_t grxsts;
  uint32_t intmsk;
  uint32_t hcchar;
  uint32_t hctsiz;
  uint32_t fifo;
  int bcnt;
  int bcnt32;
  int chidx;
  int i;

  /* Disable the RxFIFO non-empty interrupt */

  intmsk  = stm32_getreg(STM32_OTGHS_GINTMSK);
  intmsk &= ~OTGHS_GINT_RXFLVL;
  stm32_putreg(STM32_OTGHS_GINTMSK, intmsk);

  /* Read and pop the next status from the Rx FIFO */

  grxsts = stm32_getreg(STM32_OTGHS_GRXSTSP);
  uinfo("GRXSTS: %08" PRIx32 "\n", grxsts);

  /* Isolate the channel number/index in the status word */

  chidx = (grxsts & OTGHS_GRXSTSH_CHNUM_MASK) >> OTGHS_GRXSTSH_CHNUM_SHIFT;

  /* Get the host channel characteristics register (HCCHAR) */

  hcchar = stm32_getreg(STM32_OTGHS_HCCHAR(chidx));

  /* Then process the interrupt according to the packet status */

  switch (grxsts & OTGHS_GRXSTSH_PKTSTS_MASK)
    {
    case OTGHS_GRXSTSH_PKTSTS_INRECVD: /* IN data packet received */
      {
        /* Read the data into the host buffer. */

        bcnt = (grxsts & OTGHS_GRXSTSH_BCNT_MASK) >>
               OTGHS_GRXSTSH_BCNT_SHIFT;
        if (bcnt > 0 && priv->chan[chidx].buffer != NULL)
          {
            /* Transfer the packet from the Rx FIFO into the user buffer */

            dest   = (uint32_t *)priv->chan[chidx].buffer;
            fifo   = STM32_OTGHS_DFIFO_HCH(0);
            bcnt32 = (bcnt + 3) >> 2;

            for (i = 0; i < bcnt32; i++)
              {
                *dest++ = stm32_getreg(fifo);
              }

            stm32_pktdump("Received", priv->chan[chidx].buffer, bcnt);

            /* Toggle the IN data pid (Used by Bulk and INTR only) */

            priv->chan[chidx].indata1 ^= true;

            /* Manage multiple packet transfers */

            priv->chan[chidx].buffer += bcnt;
            priv->chan[chidx].xfrd   += bcnt;

            /* Check if more packets are expected */

            hctsiz = stm32_getreg(STM32_OTGHS_HCTSIZ(chidx));
            if ((hctsiz & OTGHS_HCTSIZ_PKTCNT_MASK) != 0)
              {
                /* Re-activate the channel when more packets are expected */

                hcchar |= OTGHS_HCCHAR_CHENA;
                hcchar &= ~OTGHS_HCCHAR_CHDIS;
                stm32_putreg(STM32_OTGHS_HCCHAR(chidx), hcchar);
              }
          }
      }
      break;

    case OTGHS_GRXSTSH_PKTSTS_INDONE:  /* IN transfer completed */
    case OTGHS_GRXSTSH_PKTSTS_DTOGERR: /* Data toggle error */
    case OTGHS_GRXSTSH_PKTSTS_HALTED:  /* Channel halted */
    default:
      break;
    }

  /* Re-enable the RxFIFO non-empty interrupt */

  intmsk |= OTGHS_GINT_RXFLVL;
  stm32_putreg(STM32_OTGHS_GINTMSK, intmsk);
}

/****************************************************************************
 * Name: stm32_gint_nptxfeisr
 *
 * Description:
 *   USB OTG HS non-periodic TxFIFO empty interrupt handler
 *
 ****************************************************************************/

static inline void stm32_gint_nptxfeisr(struct stm32_usbhost_s *priv)
{
  struct stm32_chan_s *chan;
  uint32_t     regval;
  unsigned int wrsize;
  unsigned int avail;
  unsigned int chidx;

  /* Recover the index of the channel that is waiting for space in the Tx
   * FIFO.
   */

  chidx = priv->chidx;
  chan  = &priv->chan[chidx];

  /* Reduce the buffer size by the number of bytes that were previously
   * placed in the Tx FIFO.
   */

  chan->buffer  += chan->inflight;
  chan->xfrd    += chan->inflight;
  chan->inflight = 0;

  /* If we have now transferred the entire buffer, then this transfer is
   * complete (this case really should never happen because we disable
   * the NPTXFE interrupt on the final packet).
   */

  if (chan->xfrd >= chan->buflen)
    {
      /* Disable further Tx FIFO empty interrupts and bail. */

      stm32_modifyreg(STM32_OTGHS_GINTMSK, OTGHS_GINT_NPTXFE, 0);
      return;
    }

  /* Read the status from the top of the non-periodic TxFIFO */

  regval = stm32_getreg(STM32_OTGHS_HNPTXSTS);

